package oOP.theory;

/**
 *  Основные принципы ООП:
 *  Инкапсуляция - объекты должны менять друг друга только через интерфейсы и не влезать во внутреннюю реализацию -
 *                 это означает, что:
 *                    - состояние объекта может быть изменено только самим объектом;
 *                    - один объект не может менять состояние другого объекта напрямую,
 *                         а должен пользоваться его поведением.
 *  Наследование - возможность порождать один класс от другого с сохранением всех свойств и методов класса-предка
 *                 (например, на основании общего двух классов создается третий - класс предка,
 *                 т.е. общее двух классов выделяется в общий класс-предка).
 *  Полиморфизм - позволяет обращаться с классом потомко так, как будто это класс предков.
 */

public class basicPrinciples {
    public static void main(String[] args) {

    }
}
